INSERT INTO category (id, name, parent_id) VALUES
    (1, 'Еда', NULL),
    (2, 'Транспорт', NULL),
    (3, 'Развлечения', NULL),
    (4, 'Доходы', NULL),
    (5, 'Другое', NULL),

-- Подкатегории
    (6, 'Кафе и рестораны', 1),
    (7, 'Продукты', 1),
    (8, 'Фастфуд', 1),
    (9, 'Такси', 2),
    (10, 'Общественный транспорт', 2),
    (11, 'Аренда авто', 2),
    (12, 'Кино', 3),
    (13, 'Концерты', 3),
    (14, 'Подписки', 3),
    (15, 'Зарплата', 4),
    (16, 'Фриланс', 4),
    (17, 'Дивиденды', 4),
    (18, 'Долги', 5),
    (19, 'Подарки', 5),
    (20, 'Ремонт', 5),
    (21, 'Кредит', 18),  -- 3-й уровень вложенности
    (22, 'Пустая категория', NULL);  -- Без транзакций для тестов